Python/install-python.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-15 水 15:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python をインストールする</title>
<meta name="generator" content="Org mode" />


</head>
<body>
<div id="content">
<h1 class="title">Python をインストールする</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc812b0c">1. Python をインストールする</a>
<ul>
<li><a href="#org180326e">1.1. Amazon Linux 2 に pyenv をインストールする</a></li>
<li><a href="#orgf5cb2ce">1.2. pyenv version コマンドと pyenv &#x2013;version コマンドの違い</a></li>
<li><a href="#org91195f6">1.3. pyenv を使ってインストール可能な python バージョンの候補を出力する</a></li>
<li><a href="#org986879b">1.4. pyenv を使って Python をインストールする</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc812b0c" class="outline-2">
<h2 id="orgc812b0c"><span class="section-number-2">1</span> Python をインストールする</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org180326e" class="outline-3">
<h3 id="org180326e"><span class="section-number-3">1.1</span> Amazon Linux 2 に pyenv をインストールする</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>前提
<ul class="org-ul">
<li>git をインストールする。</li>
</ul></li>
<li><a href="https://github.com/pyenv/pyenv">https://github.com/pyenv/pyenv</a> を読む。</li>
<li><p>
スクリプト <a href="install_pyenv.sh">install_pyenv.sh</a>
</p>
<pre class="example">
#!/usr/bin/bash -ue
which git
echo "read https://github.com/pyenv/pyenv#basic-github-checkout"
git clone https://github.com/pyenv/pyenv.git ~/.pyenv
#:Optionally, try to compile a dynamic Bash extension to speed up Pyenv. 
#:Don't worry if it fails; Pyenv will still work normally:
cd ~/.pyenv &amp;&amp; src/configure &amp;&amp; make -C src || :
if ! grep -q pyenv ~/.bash_profile ; then
    ( echo 'PATH=$PATH:~/.pyenv/bin' ; echo "export PATH" ) &gt;&gt; ~/.bash_profile
    . ~/.bash_profile
fi
which pyenv
#:expected:~/.pyenv/bin/pyenv
pyenv --version
#:expected:pyenv 2.3.12-16-gc8daaa39
pyenv install --list | grep "^ *3" | tail -n 22
#:expected:3.9.16, 3.10.0, ..., 3.11.2
</pre></li>
<li><p>
スクリプト <a href="Makefile">Makefile</a> より一部抜粋。
</p>
<pre class="example">
version/pyenv.txt:
    ./install_pyenv.sh
</pre></li>
<li><p>
以下のコマンドを実行する。
</p>
<pre class="example">
$ make version/pyenv.txt
</pre></li>
<li>Amazon Linux 2 でなくても bash と git が動作するなら他の OS でもおそらく同じ方法でできる。</li>
</ul>
</div>
</div>
<div id="outline-container-orgf5cb2ce" class="outline-3">
<h3 id="orgf5cb2ce"><span class="section-number-3">1.2</span> pyenv version コマンドと pyenv &#x2013;version コマンドの違い</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>pyenv version コマンドだと現在アクティブになっている python のバージョンを出力する。</li>
<li>pyenv &#x2013;version コマンドだと pyenv のバージョンを出力する。</li>
</ul>
</div>
</div>
<div id="outline-container-org91195f6" class="outline-3">
<h3 id="org91195f6"><span class="section-number-3">1.3</span> pyenv を使ってインストール可能な python バージョンの候補を出力する</h3>
<div class="outline-text-3" id="text-1-3">
<pre class="example">
$ pyenv install --list | grep "^ *3" | tail -n 22
  3.9.13
  ( 中略 )
  3.9.16
  3.10.0
  ( 中略 )
  3.11.2
  3.12.0a5
  3.12-dev
</pre>
</div>
</div>
<div id="outline-container-org986879b" class="outline-3">
<h3 id="org986879b"><span class="section-number-3">1.4</span> pyenv を使って Python をインストールする</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><p>
スクリプト <a href="install_python.sh">install_python.sh</a> より一部抜粋。
</p>
<pre class="example">
pyenv install "${EXPECTED_PYTHON_VERSION}"
pyenv global "${EXPECTED_PYTHON_VERSION}"
</pre></li>
<li><p>
スクリプト <a href="Makefile">Makefile</a> より一部抜粋。
</p>
<pre class="example">
version/python311.txt: version/pyenv.txt
    EXPECTED_PYTHON_VERSION=3.11.2 bash -uex ./install_python.sh
</pre></li>
<li><p>
以下のコマンドを実行する。
</p>
<pre class="example">
$ make version/python311.txt
</pre></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-03-15 水 15:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
